In [2]:
import numpy as np
import pandas as pd

In [3]:
arr = np.array([1, 2, 3, 4, 5])

In [4]:
series =pd.Series(arr)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
series = pd.Series([1, 2, 3, 4, 5])
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
data = {1: 'a', 2: 'b', 3: 'c', 4: 'd', 5: 'e'}
series = pd.Series(data)
series

1    a
2    b
3    c
4    d
5    e
dtype: object

In [12]:
series = pd.Series([1, 2, 3, 4, 5], dtype=np.float32)
series

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float32

In [13]:
series.index = [1, 2, 3, 4, 5]
series

1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
dtype: float32

In [17]:
data = [1, 2, 3, 4, 5]
index = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=index, name='num_series', dtype=np.int32)
series

a    1
b    2
c    3
d    4
e    5
Name: num_series, dtype: int32

In [23]:
series1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
series2 = pd.Series([4, 5, 6], index=['b', 'c', 'd'])

series1 / series2

a    NaN
b    0.5
c    0.6
d    NaN
dtype: float64

In [83]:
series = pd.Series([5, 2, 3, 1, 8, 2])
series.sort_values()

3    1
1    2
5    2
2    3
0    5
4    8
dtype: int64

In [32]:
series.value_counts()

2    2
5    1
3    1
1    1
8    1
Name: count, dtype: int64

In [34]:
series.tail(n=2)

4    8
5    2
dtype: int64

In [35]:
series.head(n=2)

0    5
1    2
dtype: int64

In [36]:
series.info()

<class 'pandas.core.series.Series'>
RangeIndex: 6 entries, 0 to 5
Series name: None
Non-Null Count  Dtype
--------------  -----
6 non-null      int64
dtypes: int64(1)
memory usage: 180.0 bytes

In [39]:
series.describe()

count    6.000000
mean     3.500000
std      2.588436
min      1.000000
25%      2.000000
50%      2.500000
75%      4.500000
max      8.000000
dtype: float64

In [46]:
df = pd.DataFrame(
    {
        'Name': ['John Smith', 'Jane Doe', 'Mary Hampton'],
        'Gender': ['M', 'F', 'F'],
        'Salary': np.array([70000, 55000, 87000])
     },
    index=[1, 2, 3],
)
df

           Name Gender  Salary
1    John Smith      M   70000
2      Jane Doe      F   55000
3  Mary Hampton      F   87000

In [51]:
df['Salary'] = df['Salary'].astype(np.float32)

In [52]:
df

           Name Gender   Salary
1    John Smith      M  70000.0
2      Jane Doe      F  55000.0
3  Mary Hampton      F  87000.0

In [54]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}
df = pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [56]:
df = pd.DataFrame.from_dict(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [67]:
df = pd.DataFrame.from_dict(data, orient='columns')
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [68]:
# You can set the columns too:
df = pd.DataFrame.from_dict(data, orient="index", columns=["one", "two", "three"])
df

   one  two  three
A    1    2      3
B    4    5      6
C    7    8      9

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      int64
 1   two     3 non-null      int64
 2   three   3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [70]:
df.describe()

       one  two  three
count  3.0  3.0    3.0
mean   4.0  5.0    6.0
std    3.0  3.0    3.0
min    1.0  2.0    3.0
25%    2.5  3.5    4.5
50%    4.0  5.0    6.0
75%    5.5  6.5    7.5
max    7.0  8.0    9.0

In [71]:
df.head(n=2)

   one  two  three
A    1    2      3
B    4    5      6

In [72]:
df.tail(n=2)

   one  two  three
B    4    5      6
C    7    8      9

In [119]:
df = pd.DataFrame([[1, 2, 3, 4, 5],
                   [10, 20, 30, 40, 50],
                   [100, 200, 300, 400, 500]],
                  columns=['A', 'B', 'C', 'D', 'E'],
                  index=['X', 'Y', 'Z']
)
df

     A    B    C    D    E
X    1    2    3    4    5
Y   10   20   30   40   50
Z  100  200  300  400  500

In [120]:
series1 = pd.Series([5, 10, 20], index=['X', 'Y', 'Z'])
df.add(series1, axis=0)

     A    B    C    D    E
X    6    7    8    9   10
Y   20   30   40   50   60
Z  120  220  320  420  520

In [121]:
series2 = pd.Series([5, 10, 15, 20, 25], index=['A', 'B', 'C', 'D', 'E'])
df.add(series2, axis=1)

     A    B    C    D    E
X    6   12   18   24   30
Y   15   30   45   60   75
Z  105  210  315  420  525